# Laboratorio: tratamiento de columnas

In [4]:
import pandas as pd
import numpy as np
import datetime as dt

In [33]:
bond = pd.read_csv("jamesbond.csv")
bond.head()

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7
4          Casino Royale  1967  ...   85.0               NaN

[5 rows x 7 columns]

## Cambio de nombres en las columnas

In [6]:
bond.columns = ["Movie", "Year of release", "Actor", "Director", "Box Office", "Budget", "Bond Actor Salary"]
bond.head()

                   Movie  Year of release  ... Budget Bond Actor Salary
0                 Dr. No             1962  ...    7.0               0.6
1  From Russia with Love             1963  ...   12.6               1.6
2             Goldfinger             1964  ...   18.6               3.2
3            Thunderball             1965  ...   41.9               4.7
4          Casino Royale             1967  ...   85.0               NaN

[5 rows x 7 columns]

In [9]:
bond.rename(columns = {"Year of release" : "Release date", 
                       "Box Office" : "Revenue"}, 
            inplace = True)

bond.head()

                   Movie  Release date  ... Budget Bond Actor Salary
0                 Dr. No          1962  ...    7.0               0.6
1  From Russia with Love          1963  ...   12.6               1.6
2             Goldfinger          1964  ...   18.6               3.2
3            Thunderball          1965  ...   41.9               4.7
4          Casino Royale          1967  ...   85.0               NaN

[5 rows x 7 columns]

## Eliminación de columnas

In [22]:
bond.drop(labels = ["Actor", "Revenue", "Budget"], axis = "columns", inplace = True)

In [13]:
del bond["Director"]

In [23]:
bond.head()

                   Movie  Release date  Bond Actor Salary
0                 Dr. No          1962                0.6
1  From Russia with Love          1963                1.6
2             Goldfinger          1964                3.2
3            Thunderball          1965                4.7
4          Casino Royale          1967                NaN

## Insertar valores en un dataset

In [16]:
bond.loc[1,"Actor"] = "Daniel Blanc"
bond.head()

                   Movie  Release date  ... Budget  Bond Actor Salary
0                 Dr. No          1962  ...    7.0                0.6
1  From Russia with Love          1963  ...   12.6                1.6
2             Goldfinger          1964  ...   18.6                3.2
3            Thunderball          1965  ...   41.9                4.7
4          Casino Royale          1967  ...   85.0                NaN

[5 rows x 6 columns]

## Obtener subsets

In [25]:
bond.sample(n = 4, axis = "rows")

                    Film  Year  ... Budget Bond Actor Salary
18             GoldenEye  1995  ...   76.9               5.1
11             Moonraker  1979  ...   91.5               NaN
5    You Only Live Twice  1967  ...   59.9               4.4
7   Diamonds Are Forever  1971  ...   34.7               5.8

[4 rows x 7 columns]

In [26]:
bond.nlargest(n = 5, columns = "Box Office")

             Film  Year         Actor  ... Box Office  Budget  Bond Actor Salary
24        Skyfall  2012  Daniel Craig  ...      943.5   170.2               14.5
3     Thunderball  1965  Sean Connery  ...      848.1    41.9                4.7
2      Goldfinger  1964  Sean Connery  ...      820.4    18.6                3.2
25        Spectre  2015  Daniel Craig  ...      726.7   206.3                NaN
22  Casino Royale  2006  Daniel Craig  ...      581.5   145.3                3.3

[5 rows x 7 columns]

In [27]:
bond.nsmallest(n = 4, columns = "Box Office")

                               Film  Year  ... Budget Bond Actor Salary
17                  Licence to Kill  1989  ...   56.7               7.9
15                 A View to a Kill  1985  ...   54.5               9.1
6   On Her Majesty's Secret Service  1969  ...   37.3               0.6
16             The Living Daylights  1987  ...   68.8               5.2

[4 rows x 7 columns]

## Apply

In [29]:
def pasar_a_millones(numero):
  return str(numero) + " millones."

In [30]:
pasar_a_millones(5)

'5 millones.'

In [31]:
columns = ["Box Office", "Budget", "Bond Actor Salary"]
for c in columns:
  bond[c] = bond[c].apply(pasar_a_millones)

In [32]:
bond.head()

                    Film  Year  ...          Budget Bond Actor Salary
0                 Dr. No  1962  ...   7.0 millones.     0.6 millones.
1  From Russia with Love  1963  ...  12.6 millones.     1.6 millones.
2             Goldfinger  1964  ...  18.6 millones.     3.2 millones.
3            Thunderball  1965  ...  41.9 millones.     4.7 millones.
4          Casino Royale  1967  ...  85.0 millones.     nan millones.

[5 rows x 7 columns]

In [44]:
bond.iloc[0]

juicio_pelicula            No idea
Film                        Dr. No
Year                          1962
Actor                 Sean Connery
Director             Terence Young
Box Office                   448.8
Budget                           7
Bond Actor Salary              0.6
Budget en dólares              322
Name: 0, dtype: object

In [ ]:
def buena_pelicula(fila):

  actor = fila[2]
  budget = fila[5]

  if actor == "Pierce Brosnan":
    return "The best"
  elif actor == "Roger Moore" and budget > 40:
    return "Ok"
  else:
    return "No idea"

bond.apply(buena_pelicula, axis = "columns")

In [37]:
juicios_pelis = bond.apply(buena_pelicula, axis = "columns")
bond.insert(0, # Lugar en donde inserto la columnas
            "juicio_pelicula", # Nombre de la columna nueva
            juicios_pelis) # Elementos que componen la nueva columna

In [40]:
bond.head(15)

   juicio_pelicula                             Film  ...  Budget Bond Actor Salary
0          No idea                           Dr. No  ...     7.0               0.6
1          No idea            From Russia with Love  ...    12.6               1.6
2          No idea                       Goldfinger  ...    18.6               3.2
3          No idea                      Thunderball  ...    41.9               4.7
4          No idea                    Casino Royale  ...    85.0               NaN
5          No idea              You Only Live Twice  ...    59.9               4.4
6          No idea  On Her Majesty's Secret Service  ...    37.3               0.6
7          No idea             Diamonds Are Forever  ...    34.7               5.8
8          No idea                 Live and Let Die  ...    30.8               NaN
9          No idea      The Man with the Golden Gun  ...    27.7               NaN
10              Ok             The Spy Who Loved Me  ...    45.1               NaN
11              Ok                        Moonraker  ...    91.5               NaN
12              Ok               For Your Eyes Only  ...    60.2               NaN
13         No idea            Never Say Never Again  ...    86.0               NaN
14              Ok                        Octopussy  ...    53.9               7.8

[15 rows x 8 columns]

In [42]:
bond["Budget en dólares"] = bond["Budget"] * 46
bond.head()

  juicio_pelicula                   Film  ...  Bond Actor Salary Budget en dólares
0         No idea                 Dr. No  ...                0.6             322.0
1         No idea  From Russia with Love  ...                1.6             579.6
2         No idea             Goldfinger  ...                3.2             855.6
3         No idea            Thunderball  ...                4.7            1927.4
4         No idea          Casino Royale  ...                NaN            3910.0

[5 rows x 9 columns]